python/pip-anaconda-package.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-14 Thu 13:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pip 包管理和 Anaconda发行包</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">pip 包管理和 Anaconda发行包</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc121b00">1. Pip 介绍</a></li>
<li><a href="#orgb3f3d48">2. 常用命令</a>
<ul>
<li><a href="#orgf7f0071">2.1. 列出当前所有包</a></li>
<li><a href="#org9c82d02">2.2. 更新所有包到最新版本</a></li>
<li><a href="#orgd3a8248">2.3. 批量导出/安装包 <code>requirements.txt</code></a></li>
<li><a href="#org2c7a2ca">2.4. 离线下载/安装 wheel 包</a></li>
<li><a href="#orge2b12fb">2.5. 部署的最佳实践</a></li>
</ul>
</li>
<li><a href="#orgc065fb9">3. 虚拟环境</a>
<ul>
<li><a href="#org2d84ba5">3.1. 建立虚拟环境</a></li>
<li><a href="#org5823811">3.2. 激活/取消虚拟环境</a></li>
<li><a href="#org7d9a05b">3.3. 在 Windows 下使用虚拟环境</a></li>
</ul>
</li>
<li><a href="#org467e6eb">4. Anaconda3 相关命令</a>
<ul>
<li><a href="#orgee6df3c">4.1. 创建虚拟环境</a></li>
<li><a href="#org67f9ad9">4.2. 依赖包管理</a></li>
<li><a href="#org7f3d953">4.3. 处理额外的安装包</a></li>
<li><a href="#org2720ae2">4.4. 下线 Anaconda 安装包</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgc121b00" class="outline-2">
<h2 id="orgc121b00"><span class="section-number-2">1</span> Pip 介绍</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://pypi.org/project/pip/">pip</a> 是 python 的包管理工具，在国内可以替换 <a href="https://mirrors.tuna.tsinghua.edu.cn/help/pypi/">清华 pypi 镜像</a> 下载源来加快下载速度。
pip 工具在 Windows 和 Unix 环境下的配置文件位置如下
</p>

<ul class="org-ul">
<li>Windows: <code>~/pip/pip.ini</code></li>
<li>Mac &amp; Linux: <code>~/.pip/pip.conf</code></li>
</ul>

<p>
需要配置项的内容如下：
</p>
<div class="org-src-container">
<pre class="src src-conf">[<span style="color: #268bd2;">global</span>]
<span style="color: #6c71c4;">index-url</span> = https://pypi.tuna.tsinghua.edu.cn/simple

[<span style="color: #268bd2;">list</span>]
<span style="color: #6c71c4;">format</span> = columns
</pre>
</div>

<p>
也可以用如下的命令直接设置
</p>
<div class="org-src-container">
<pre class="src src-sh">pip install pip -U -i https://pypi.tuna.tsinghua.edu.cn/simple
pip config set global.index-url https://pypi.tuna.tsinghua.edu.cn/simple
pip config set install.trusted-host pypi.tuna.tsinghua.edu.cn
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3f3d48" class="outline-2">
<h2 id="orgb3f3d48"><span class="section-number-2">2</span> 常用命令</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf7f0071" class="outline-3">
<h3 id="orgf7f0071"><span class="section-number-3">2.1</span> 列出当前所有包</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-sh">~ $ pip list
Package                Version
---------------------- ----------
appnope                0.1.0
autopep8               1.4.3
backcall               0.1.0
certifi                2018.11.29
chardet                3.0.4
cycler                 0.10.0
flake8                 3.6.0
get                    2018.11.19
idna                   2.8
ipdb                   0.12
ipython                7.6.0
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c82d02" class="outline-3">
<h3 id="org9c82d02"><span class="section-number-3">2.2</span> 更新所有包到最新版本</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh">pip freeze --local | grep -v <span style="color: #2aa198;">'^\-e'</span> | cut -d = -f 1  | xargs -n1 pip install -U
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd3a8248" class="outline-3">
<h3 id="orgd3a8248"><span class="section-number-3">2.3</span> 批量导出/安装包 <code>requirements.txt</code></h3>
<div class="outline-text-3" id="text-2-3">
<p>
在 Python 项目中通常有一个 <code>requirements.txt</code> 文件，该文件记录项目所需的包和相
应的版本号。
</p>
<div class="org-src-container">
<pre class="src src-sh">pip freeze &gt; requirements.txt
pip install -r requirements.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c7a2ca" class="outline-3">
<h3 id="org2c7a2ca"><span class="section-number-3">2.4</span> 离线下载/安装 wheel 包</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#23558; =requirements.txt= &#20013;&#30340;&#25152;&#26377;&#20381;&#36182;&#30340; wheel &#21253;&#19979;&#36733;&#21040; wheels &#25991;&#20214;&#22841;&#20013;</span>
pip download -d wheels -r requirements.txt

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#23558; wheels &#25991;&#20214;&#22841;&#20013;&#30340;&#21253;&#23433;&#35013;&#21040;&#29615;&#22659;&#20013;</span>
pip install --no-index --find-link=wheels -r requirements.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2b12fb" class="outline-3">
<h3 id="orge2b12fb"><span class="section-number-3">2.5</span> 部署的最佳实践</h3>
<div class="outline-text-3" id="text-2-5">
<p>
一般可以将下载的 wheel 包放在摆渡机的 <code>~/.pip/cache</code> 文件夹中
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">download and save packages to ~/.pip/cache</span>
pip download -d ~/.pip/cache &lt;name&gt;

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">upload packages to remote machine</span>
rsync -av ~/.pip/cache/ user@host:~/.pip/cache

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">install on remote machine</span>
pip install --no-index --find-link=~/.pip/cache &lt;name&gt;
</pre>
</div>

<p>
也可以添加环境变量来指定 pip 工具的缓存目录
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6c71c4;">export</span> <span style="color: #6c71c4;">PIP_DOWNLOAD_CACHE</span>=$<span style="color: #6c71c4;">HOME</span>/.pip/cache
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc065fb9" class="outline-2">
<h2 id="orgc065fb9"><span class="section-number-2">3</span> 虚拟环境</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2d84ba5" class="outline-3">
<h3 id="org2d84ba5"><span class="section-number-3">3.1</span> 建立虚拟环境</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh">mkdir ~/.venv &amp;&amp; <span style="color: #6c71c4;">cd</span> ~/.venv

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#23433;&#35013; virtualenv &#20381;&#36182;</span>
pip3 install virtualenv
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#22914;&#26524;&#27809;&#26377;&#31995;&#32479;&#30340; root &#26435;&#38480;&#30340;&#35805;&#21152; --user &#22312;&#29992;&#25143;&#32423;&#21035;&#23433;&#35013;&#21363;&#21487;</span>
pip3 install --user virtualenv

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#26032;&#24314;&#34394;&#25311;&#29615;&#22659;</span>
virtualenv dev --python=python3
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#21478;&#22806;&#19968;&#31181;&#24314;&#34394;&#25311;&#29615;&#22659;&#30340;&#26041;&#24335;</span>
python3 -m venv env
</pre>
</div>
</div>
</div>

<div id="outline-container-org5823811" class="outline-3">
<h3 id="org5823811"><span class="section-number-3">3.2</span> 激活/取消虚拟环境</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#28608;&#27963;&#34394;&#25311;&#29615;&#22659;</span>
source path/to/bin/activate

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#21462;&#28040;&#34394;&#25311;&#29615;&#22659;</span>
deactivate
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d9a05b" class="outline-3">
<h3 id="org7d9a05b"><span class="section-number-3">3.3</span> 在 Windows 下使用虚拟环境</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#19979;&#36733; virtualenv &#21253;</span>
pip install virtualenv

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#24314;&#31435;&#21644;&#28608;&#27963;&#34394;&#25311;&#29615;&#22659;</span>
python3 -m virtualenv .venv
.venv\Scripts\activate
</pre>
</div>

<p>
使用 virtualenvwrapper 工具
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#19979;&#36733; virtualenvwrapper-win</span>
pip install virtualenvwrapper-win

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">WORKON_HOME &#26159; %USERPROFILE%\Envs</span>
mkvirtualenv myenv
workon myenv
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org467e6eb" class="outline-2">
<h2 id="org467e6eb"><span class="section-number-2">4</span> Anaconda3 相关命令</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgee6df3c" class="outline-3">
<h3 id="orgee6df3c"><span class="section-number-3">4.1</span> 创建虚拟环境</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#21019;&#24314;&#21644;&#20351;&#29992; anaconda &#30340;&#34394;&#25311;&#29615;&#22659;</span>
conda create -y --offline -n tf113

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#20811;&#38534;&#34394;&#25311;&#29615;&#22659;</span>
conda create -y --offline -n tf113 --clone base

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#28608;&#27963;&#34394;&#25311;&#29615;&#22659;</span>
source activate tf113

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#21462;&#28040;&#28608;&#27963;&#34394;&#25311;&#29615;&#22659;</span>
source deactivate

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#21024;&#38500;&#34394;&#25311;&#29615;&#22659;&#30340;&#25152;&#26377;&#21253;</span>
conda remove -n test02 --all

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#26597;&#30475;&#25152;&#26377;&#34394;&#25311;&#29615;&#22659;</span>
conda env list
</pre>
</div>
</div>
</div>

<div id="outline-container-org67f9ad9" class="outline-3">
<h3 id="org67f9ad9"><span class="section-number-3">4.2</span> 依赖包管理</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#23548;&#20986;&#29615;&#22659;&#20013;&#30340;&#23433;&#35013;&#21253;</span>
conda list -e &gt; requirements.txt

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#23433;&#35013;&#29615;&#22659;&#20381;&#36182;&#21040;&#29615;&#22659;&#20013;</span>
conda install -y <span style="color: #6c71c4;">tensorflow</span>==1.13.1
conda install --yes --file requirements.txt

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#19979;&#36733;&#23433;&#35013;&#21253;, &#32531;&#23384;&#22312; ~/.conda/pkgs/ &#25991;&#20214;&#22841;&#20013;</span>
conda install --download-only -y <span style="color: #6c71c4;">tensorflow</span>==1.13.1
conda install --download-only -y tensorflow-gpu==1.13.1
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f3d953" class="outline-3">
<h3 id="org7f3d953"><span class="section-number-3">4.3</span> 处理额外的安装包</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#19979;&#36733; tensorflow &#30340;&#23433;&#35013;&#21253;, &#32531;&#23384;&#25991;&#20214;&#22841;&#20026; wheels</span>
pip download -i https://pypi.tuna.tsinghua.edu.cn/simple -d wheels <span style="color: #6c71c4;">tensorflow</span>==1.13.1

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#23433;&#35013; wheels &#25991;&#20214;&#22841;&#19979;&#30340;&#21253;</span>
pip install --no-index --find-link=wheels -r requirements.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-org2720ae2" class="outline-3">
<h3 id="org2720ae2"><span class="section-number-3">4.4</span> 下线 Anaconda 安装包</h3>
<div class="outline-text-3" id="text-4-4">
<p>
直接去清华镜像源中下载 <a href="https://mirrors.tuna.tsinghua.edu.cn/anaconda/archive/">Anaconda</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2021-10-14 Thu 13:09. Created by Jinghui Hu at 2018-10-08 Mon 11:04.</p>
</div>
</body>
</html>
